tests/Motivation-GC-1/DATA/rw/fio_output_1G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 1024MiB) test: (groupid=0, jobs=1): err= 0: pid=972220: Sun Feb 9 14:50:29 2025 write: IOPS=195k, BW=761MiB/s (798MB/s)(1024MiB/1346msec); 0 zone resets clat (usec): min=2, max=1309, avg= 4.55, stdev= 6.24 lat (usec): min=2, max=1309, avg= 4.62, stdev= 6.24 clat percentiles (nsec): | 1.00th=[ 2864], 5.00th=[ 3088], 10.00th=[ 3248], 20.00th=[ 3440], | 30.00th=[ 3632], 40.00th=[ 3824], 50.00th=[ 4128], 60.00th=[ 4768], | 70.00th=[ 5152], 80.00th=[ 5536], 90.00th=[ 6176], 95.00th=[ 6816], | 99.00th=[ 7712], 99.50th=[ 8032], 99.90th=[ 8768], 99.95th=[ 9152], | 99.99th=[17024] bw ( KiB/s): min=780360, max=780368, per=100.00%, avg=780364.00, stdev= 5.66, samples=2 iops : min=195090, max=195092, avg=195091.00, stdev= 1.41, samples=2 lat (usec) : 4=47.05%, 10=52.92%, 20=0.02%, 50=0.01%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01% cpu : usr=13.01%, sys=86.77%, ctx=37, majf=0, minf=10 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=761MiB/s (798MB/s), 761MiB/s-761MiB/s (798MB/s-798MB/s), io=1024MiB (1074MB), run=1346-1346msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%