tests/Motivation-GC-1/DATA/rw/fio_output_1G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 1024MiB) test: (groupid=0, jobs=1): err= 0: pid=188927: Mon Feb 10 09:12:23 2025 write: IOPS=239k, BW=933MiB/s (979MB/s)(1024MiB/1097msec); 0 zone resets clat (usec): min=2, max=1310, avg= 3.81, stdev= 6.43 lat (usec): min=2, max=1310, avg= 3.86, stdev= 6.43 clat percentiles (nsec): | 1.00th=[ 2480], 5.00th=[ 2672], 10.00th=[ 2800], 20.00th=[ 2960], | 30.00th=[ 3088], 40.00th=[ 3248], 50.00th=[ 3376], 60.00th=[ 3600], | 70.00th=[ 4192], 80.00th=[ 4640], 90.00th=[ 5024], 95.00th=[ 5472], | 99.00th=[ 6816], 99.50th=[ 7456], 99.90th=[19072], 99.95th=[20352], | 99.99th=[22912] bw ( KiB/s): min=956152, max=958688, per=100.00%, avg=957420.00, stdev=1793.22, samples=2 iops : min=239038, max=239672, avg=239355.00, stdev=448.31, samples=2 lat (usec) : 4=68.08%, 10=31.64%, 20=0.23%, 50=0.05%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01% cpu : usr=8.30%, sys=91.33%, ctx=1, majf=0, minf=12 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,262144,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=933MiB/s (979MB/s), 933MiB/s-933MiB/s (979MB/s-979MB/s), io=1024MiB (1074MB), run=1097-1097msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%