tests/Motivation-GC-1/DATA/rw/fio_output_2G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 2048MiB) test: (groupid=0, jobs=1): err= 0: pid=972792: Sun Feb 9 14:50:40 2025 write: IOPS=201k, BW=785MiB/s (823MB/s)(2048MiB/2608msec); 0 zone resets clat (usec): min=2, max=3439, avg= 4.37, stdev=13.72 lat (usec): min=2, max=3439, avg= 4.44, stdev=13.72 clat percentiles (nsec): | 1.00th=[ 2864], 5.00th=[ 3088], 10.00th=[ 3216], 20.00th=[ 3408], | 30.00th=[ 3536], 40.00th=[ 3696], 50.00th=[ 3888], 60.00th=[ 4192], | 70.00th=[ 4832], 80.00th=[ 5216], 90.00th=[ 5792], 95.00th=[ 6432], | 99.00th=[ 7648], 99.50th=[ 7968], 99.90th=[ 8640], 99.95th=[ 8896], | 99.99th=[12992] bw ( KiB/s): min=786568, max=815648, per=100.00%, avg=804950.40, stdev=11030.48, samples=5 iops : min=196642, max=203912, avg=201238.00, stdev=2757.63, samples=5 lat (usec) : 4=54.75%, 10=45.24%, 20=0.01%, 50=0.01%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01% cpu : usr=11.62%, sys=88.26%, ctx=3, majf=0, minf=11 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=785MiB/s (823MB/s), 785MiB/s-785MiB/s (823MB/s-823MB/s), io=2048MiB (2147MB), run=2608-2608msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%