tests/Motivation-GC-1/DATA/rw/fio_output_2G
test: (g=0): rw=randwrite, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=sync, iodepth=1 fio-3.32 Starting 1 process test: Laying out IO file (1 file / 2048MiB) test: (groupid=0, jobs=1): err= 0: pid=189581: Mon Feb 10 09:12:28 2025 write: IOPS=219k, BW=855MiB/s (897MB/s)(2048MiB/2394msec); 0 zone resets clat (usec): min=2, max=2000, avg= 4.20, stdev= 8.67 lat (usec): min=2, max=2000, avg= 4.24, stdev= 8.67 clat percentiles (nsec): | 1.00th=[ 2576], 5.00th=[ 2768], 10.00th=[ 2896], 20.00th=[ 3088], | 30.00th=[ 3280], 40.00th=[ 3440], 50.00th=[ 3696], 60.00th=[ 4256], | 70.00th=[ 4768], 80.00th=[ 5088], 90.00th=[ 5792], 95.00th=[ 6432], | 99.00th=[ 7392], 99.50th=[ 7776], 99.90th=[18560], 99.95th=[20864], | 99.99th=[22912] bw ( KiB/s): min=864232, max=886128, per=100.00%, avg=878462.00, stdev=10078.73, samples=4 iops : min=216058, max=221532, avg=219615.50, stdev=2520.12, samples=4 lat (usec) : 4=57.26%, 10=42.51%, 20=0.16%, 50=0.06%, 100=0.01% lat (usec) : 250=0.01%, 500=0.01%, 750=0.01%, 1000=0.01% lat (msec) : 2=0.01%, 4=0.01% cpu : usr=5.64%, sys=94.32%, ctx=2, majf=0, minf=11 IO depths : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0% submit : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% complete : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0% issued rwts: total=0,524288,0,0 short=0,0,0,0 dropped=0,0,0,0 latency : target=0, window=0, percentile=100.00%, depth=1 Run status group 0 (all jobs): WRITE: bw=855MiB/s (897MB/s), 855MiB/s-855MiB/s (897MB/s-897MB/s), io=2048MiB (2147MB), run=2394-2394msec Disk stats (read/write): pmem0: ios=0/0, merge=0/0, ticks=0/0, in_queue=0, util=0.00%